[
  {
    datetime: 1657749818000,
    headline: 'Twitter sues Elon Musk over $44bn purchase deal - Ghanamma.com',
    source: 'Ghana MMA',
    url: 'https://cloud.iexapis.com/v1/news/article/qXvtktgTsY5aDA5rCGfN4IDhd77bMcymoTe1AuEFcNy',
    summary: 'Tesla CEO Elon Musk attends the Tesla Shanghai Gigafactory groundbreaking ceremony in Shanghai, China January 7, 2019. REUTERS/Aly Song/ Twitter is suing billionaire Elon Musk to try to force him to buy the social media firm, setting up a legal battle with the world’s richest man. It comes after Mr Musk announced he was walking away […]',
    related: 'TWTR,TSLA,TL0-GD,TL0-GS,TL0-GH,TL0-GM,TL0-GF,TL0-GB,TL0-GY,TL0-GI',
    image: 'https://cloud.iexapis.com/v1/news/image/qXvtktgTsY5aDA5rCGfN4IDhd77bMcymoTe1AuEFcNy',
    lang: 'en',
    hasPaywall: false
  },
  {
    datetime: 1657749657000,
    headline: 'The 4 Best Automotive Stocks to Buy Now in July 2022',
    source: 'InvestorPlace',
    url: 'https://cloud.iexapis.com/v1/news/article/3osQKv7P3IoSEbsFi1TSNjBrJtB8arawxwzAssMAtwiA',
    summary: 'With oil prices dropping sharply, interest-rate hikes poised to slow, supply chains improving, China’s lockdowns winding down, and the electric vehicle (EV) revolution accelerating, it’s a very good time to buy the best automotive stocks. Also helping the automotive sector’s outlook is the extremely overdone retreat that it has suffered in recent months. The recent, sharp decline of oil prices should dramatically lower inflation, enabling the Federal Reserve to lower interest rates at a much slower pace going forward and making new vehicles more affordable. Lower gasoline prices will also incentivize more Americans to buy large vehicles. Tesla (NASDAQ: TSLA ) recently indicated that its supply chain issues had improved. Moreover, a Forbes columnist last month reported that automakers’ global supply chain was rebounding. Those changes should raise automakers’ margins and enable them to more easily meet demand. Finally, in the U.S., China, and Europe, the EV revolution is gathering momentum, continuing to provide investors with huge, new opportunities. 7 Best Dow Stocks to Buy in July Here are my top picks for the four best automotive stocks to buy in the current environment: Ticker Company Price GM General Motors Company $30.80 VLKAF Volkswagen AG $108 ARVL Arrival $1.50 RIVN Rivian Automotive, Inc. $30.78 Best Automotive Stocks: General Motors (GM) Source: Jonathan Weiss / Shutterstock.com General Motors (NYSE: GM ) recently reported that , amid “lingering supply chain disruptions” it had sold 15% fewer vehicles in the U.S. in the second quarter (Q2) than during the same period a year earlier.',
    related: 'AMZN,BLK,GM,UPS,UPAB-GD,UPAB-GS,UPAB-GH,UPAB-GM,UPAB-GF,UPAB-GB,UPAB-GY,UPAB-GI,MS,VOW3-GD,VOW3-GS,VOW3-GH,VOW3-GM,VOW3-GF,VOW3-GB,VOW3-GY,VOW3-GI,VOW-GD,VOW-GS,VOW-GH,VOW-GM,VOW-GF,VOW-GB,VOW-GY,VOW-GI,VLKAF,VWAGY,ENEL-IM,ENLAY,ESOCF,ENL-GD,ENL-GS,ENL-GH,ENL-GM,ENL-GF,ENL-GB,ENL-GY,ENL-GI,UBER,UT8-GD,UT8-GS,UT8-GH,UT8-GM,UT8-GF,UT8-GB,UT8-GY,UT8-GI,DJIA,ARVL,SSTK,0A8F-LN,TSLA,TL0-GD,TL0-GS,TL0-GH,TL0-GM,TL0-GF,TL0-GB,TL0-GY,TL0-GI,PAH3-GD,PAH3-GS,PAH3-GH,PAH3-GM,PAH3-GF,PAH3-GB,PAH3-GY,PAH3-GI,POAHF,POAHY,RIVN',
    image: 'https://cloud.iexapis.com/v1/news/image/3osQKv7P3IoSEbsFi1TSNjBrJtB8arawxwzAssMAtwiA',
    lang: 'en',
    hasPaywall: false
  },
  {
    datetime: 1657749198000,
    headline: "Tesla''s AI director leaving company after 4-month sabbatical",
    source: 'Channel NewsAsia',
    url: 'https://cloud.iexapis.com/v1/news/article/3Ab0qd39Vpccs14VbAj6UtBugNknLAP4zL7EYbyTDFZP',
    summary: `San Francisco : Andrej Karpathy, director of artificial intelligence at Tesla Inc who has been on a four-month sabbatical, said on Wednesday that he is leaving the company."It''s been a great pleasure to help Tesla towards its goals over the last 5 years and a difficult decision to part ways," Karpathy twe`,
    related: 'TSLA,TL0-GD,TL0-GS,TL0-GH,TL0-GM,TL0-GF,TL0-GB,TL0-GY,TL0-GI',
    image: 'https://cloud.iexapis.com/v1/news/image/3Ab0qd39Vpccs14VbAj6UtBugNknLAP4zL7EYbyTDFZP',
    lang: 'en',
    hasPaywall: false
  },
  {
    datetime: 1657748911000,
    headline: 'Andrej Karpathy departs from Tesla after taking sabbatical',
    source: 'Drive Tesla Canada',
    url: 'https://cloud.iexapis.com/v1/news/article/3Wm85uu011ajzfF08s7z3VN1kn6s4oF0kDzqIy66qhPD',
    summary: 'Tesla’s Senior Director of Artificial Intelligence (AI) Andrej Karpathy has announced he is leaving the company. Karpathy announced his departure on Twitter on Wednesday afternoon, just as he was about to return to Tesla after […] The post Andrej Karpathy departs from Tesla after taking sabbatical appeared first on Drive Tesla .',
    related: 'TSLA,TL0-GD,TL0-GS,TL0-GH,TL0-GM,TL0-GF,TL0-GB,TL0-GY,TL0-GI',
    image: 'https://cloud.iexapis.com/v1/news/image/3Wm85uu011ajzfF08s7z3VN1kn6s4oF0kDzqIy66qhPD',
    lang: 'en',
    hasPaywall: false
  }
]
