[
  {
    datetime: 1657828222000,
    headline: 'Federal Agency’s Letter to Elon Musk Questions Tweet About Twitter Deal',
    source: 'The Epoch Times',
    url: 'https://cloud.iexapis.com/v1/news/article/2f82kpWp9bUsVva34bt0dIATIVa9nuSVYYJnvU25cukI',
    summary: 'The U.S. Securities and Exchange Commission asked Tesla CEO Elon Musk for more details related to his Twitter deal, regarding the $44 billion purchase that he recently attempted to pull out of, according to a new regulatory filing issued Thursday. On May 13, Musk wrote that the Twitter deal was “temporarily on hold” after the […]',
    related: 'TWTR,TSLA,TL0-GD,TL0-GS,TL0-GH,TL0-GM,TL0-GF,TL0-GB,TL0-GY,TL0-GI',
    image: 'https://cloud.iexapis.com/v1/news/image/2f82kpWp9bUsVva34bt0dIATIVa9nuSVYYJnvU25cukI',
    lang: 'en',
    hasPaywall: false
  },
  {
    datetime: 1657826700000,
    headline: "Elon The Scofflaw? Here''s What Could Happen If Musk Loses And Still Refuses To Buy Twitter",
    source: 'Zero Hedge',
    url: 'https://cloud.iexapis.com/v1/news/article/D7vuhbSLkKdb8fmDA9HbKIIXsFcYBGmM4WFLNZM52yw',
    summary: "Elon The Scofflaw? Here''s What Could Happen If Musk Loses And Still Refuses To Buy Twitter As Twitter''s lawsuit to force Elon Musk to complete his $44 billion purchase of the company heats up, many are speculating what might happen if Musk simply refuses no matter the outcome. And while he''s given no indication he won''t comply, it''s a fun thought exercise, courtesy of Bloomberg Law . To review, Musk claims that Twitter has essentially committed fraud by vastly underreporting the number of ''bots'' or fake users on the platform. Twitter claims it''s under 5%, while Musk claims it could be 10x that amount and filed to pull out of the deal last Friday . The lawsuit''s venue is Delaware''s Cancery Court, which has no jury , and will thus be decided by a judge - in this case, 42-year-old Chief Judge Kathaleen St. J. McCormick - who was appointed to the bench by Democratic Governor John Carney in 2021. Judge Kathaleen St. J. McCormick So, what if McCormick orders Musk to move forward with the purchase and he simply refuses?",
    related: 'TWTR,TSLA,TL0-GD,TL0-GS,TL0-GH,TL0-GM,TL0-GF,TL0-GB,TL0-GY,TL0-GI',
    image: 'https://cloud.iexapis.com/v1/news/image/D7vuhbSLkKdb8fmDA9HbKIIXsFcYBGmM4WFLNZM52yw',
    lang: 'en',
    hasPaywall: false
  },
  {
    datetime: 1657826120000,
    headline: 'Tesla autopilot head quits amid pressure over crashes',
    source: 'The Washington Times',
    url: 'https://cloud.iexapis.com/v1/news/article/2HS5AnGmv8FSKBdqBSeDxM8hKcy0dUFb9t7dxkoPhpyf',
    summary: "A senior executive at Tesla''s autopilot division announced he is leaving the company amid increasing scrutiny of the electric-car company''s self-driving vehicles.",
    related: 'TSLA,TL0-GD,TL0-GS,TL0-GH,TL0-GM,TL0-GF,TL0-GB,TL0-GY,TL0-GI',
    image: 'https://cloud.iexapis.com/v1/news/image/2HS5AnGmv8FSKBdqBSeDxM8hKcy0dUFb9t7dxkoPhpyf',
    lang: 'en',
    hasPaywall: false
  },
  {
    datetime: 1657825895000,
    headline: 'Panasonic battery project is not just for Tesla, says US envoy to Japan',
    source: 'Gadgets Now',
    url: 'https://cloud.iexapis.com/v1/news/article/3D8vMSfWCpExkcLtGAfIjRUek8h4UX4fI78oJrTLywzC',
    summary: 'Panasonic, a major supplier to Tesla, earlier said it was planning a $4 billion EV battery project in De Soto, Kansas that would create up to 4,000 jobs.',
    related: 'PCRFY,PCRFF,TSLA,TL0-GD,TL0-GS,TL0-GH,TL0-GM,TL0-GF,TL0-GB,TL0-GY,TL0-GI',
    image: 'https://cloud.iexapis.com/v1/news/image/3D8vMSfWCpExkcLtGAfIjRUek8h4UX4fI78oJrTLywzC',
    lang: 'en',
    hasPaywall: false
  }
]
